{
  "title": "EXPERIÊNCIA PROFISSIONAL",
  "theloop": {
    "duration": "out 2022 - Presente",
    "description": "A Loop foi o palco da minha consolidação como Senior Developer e onde dei o salto para a gestão técnica. O meu percurso iniciou-se no desenvolvimento do Point of Sale (POS) da Ticketline, utilizando React, mas rapidamente evoluiu para desafios de maior escala no setor bancário. \n Integrei a equipa da Caixa Geral de Depósitos na plataforma de gestão empresarial, onde, apoiado em Angular e Google Cloud, não só desenvolvi funcionalidades críticas, como elevei o padrão de qualidade da equipa. Implementei rotinas rigorosas de code review, testes unitários e assumi a mentoria técnica de colegas, garantindo as melhores práticas de engenharia. \n A minha evolução culminou no projeto do Santander, onde assumi a posição de Senior Developer no módulo de Private Banking. Aqui, a minha responsabilidade extravasou o código: fui responsável pelo Release Management, gestão de deploys e configuração de ambientes. Atuei ainda como ponto de contacto principal com o cliente, gerindo expectativas e garantindo a entrega contínua dentro do cockpit principal do banco."
  },
  "devoteam": {
    "duration": "abr 2022 - out 2022",
    "description": "Na Devoteam, optei por elevar o meu perfil técnico ao fundir o desenvolvimento frontend com cloud services. O meu percurso focou-se na integração de interfaces com o ecossistema da AWS, o que me permitiu compreender a arquitetura de software para além do código que corre no browser. \n Contribuí ativamente para o desenvolvimento de plataformas internas com recurso a Angular, otimizando processos operacionais da consultora. Paralelamente, validei os meus conhecimentos de infraestrutura e serviços em cloud ao concluir a certificação AWS Cloud Practitioner, um passo que me permitiu alinhar o desenvolvimento de aplicações com as melhores práticas de escalabilidade e segurança em cloud."
  },
  "inova": {
    "duration": "set 2021 - abr 2022",
    "description": "Encontrei a minha rampa de lançamento na Inova+, onde assumi um perfil fullstack. Fui inteiramente responsável pelo desenvolvimento de dois projetos greenfield, com recurso a Angular no frontend e NodeJS no backend. \n O primeiro, o BIOMA, consistiu numa plataforma digital de apoio à sustentabilidade focada na cadeia de valor agroalimentar. O segundo e mais complexo foi o City-Catalyst. Aqui, não só desenvolvi software, como participei nas fases de investigação e validação em contexto real, em cinco cidades portuguesas. O grande objetivo passou por criar uma solução de interoperabilidade entre plataformas urbanas, facilitando uma gestão mais eficiente de métricas dentro de cidades inteligentes."
  },
  "optionq": {
    "duration": "out 2020 - abr 2021",
    "description": "A OptionQ representou a minha entrada oficial na carreira profissional e colocou-me num papel de interseção entre as equipas de design e engenharia. Integrei assim a equipa de desenvolvimento de um produto interno, uma plataforma de comparação de produtos. \n A minha responsabilidade passou por desenhar e validar interfaces de UI/UX no Figma e garantir a sua implementação em código. Foi aqui que consolidei os meus conhecimentos em React, aplicando-os pela primeira vez num ambiente real regido por Agile. Esta experiência ensinou-me a importância da comunicação constante em sprints e a traduzir requisitos visuais em componentes funcionais e reutilizáveis."
  },
  "vetbizz": {
    "duration": "set 2019 - jul 2020",
    "description": "A VetBizz Consulting marcou o início da minha carreira profissional e foi o ambiente onde traduzi a teoria académica em soluções reais do mercado de trabalho. Enquanto software engineer em estágio curricular, fui responsável por desenhar e implementar ferramentas de apoio às operações da consultora. O meu principal foco foi o desenvolvimento de um dashboard de análise estatística, utilizando HTML, CSS e jQuery, capaz de permitir à equipa visualizar métricas de negócio de forma centralizada. \n Além do frontend, mergulhei no backend com PHP, onde desenvolvi cron-jobs para otimizar a gestão de clientes. Estas automações incluíram o envio programado de emails e a manipulação dinâmica de documentos, reduzindo tarefas manuais repetitivas. Esta experiência foi fundamental para consolidar a minha compreensão do ciclo de vida do desenvolvimento de software e ainda colocar em prática os conceitos teóricos até agora adquiridos."
  }
}
